tutorials/ancientStuff/solidMechanics/immersedTauFastenerElasticSolidFoam/demo5/demoTauFastener5/0/W
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "2800";
    object      W;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
91924
(
(0.00013095 3.35754e-05 -8.92788e-06)
(0.000186969 3.47578e-05 4.7313e-05)
(0.0001024 1.13718e-05 2.24109e-05)
(5.007e-05 2.17355e-06 2.14298e-06)
(2.40262e-05 8.59477e-07 1.2089e-06)
(1.13185e-05 3.32711e-07 6.07047e-07)
(5.47536e-06 1.03797e-07 2.71969e-07)
(2.82273e-06 1.70649e-08 1.35765e-07)
...
)
;

boundaryField
{
    wall2
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    wall1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    inlet
    {
	type		zeroGradient;
    }
}


// ************************************************************************* //
