tutorials/ancientStuff/solidMechanics/immersedTauFastenerElasticSolidFoam/demo5/demoTauFastener5/0/pFastener
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      pFastener;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    outlet
    {
        type           zeroGradient;
    }
    defaultName
    {
        type           zeroGradient;
    }

   wall1
    {
        type           zeroGradient;
    }

   wall2
    {
        type           zeroGradient;
    }
		
    inlet
    {
        type           zeroGradient;
    }
	
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
